--- D? li?u c?a khách hàng
set dateformat dmy
go
INSERT INTO KhachHang (MaKhachHang, HoTen, SoDienThoai, DiaChi, NgaySinh,GioiTinh, GhiChu,CCCD) VALUES
('KH001', N'Nguy?n V?n An', '0123456789', N'Hà N?i', '1990-01-01', N'Nam', '','077001234567'),
('KH002', N'Tr?n Th? Bình', '0123456790', N'TP H? Chí Minh', '1992-02-02', N'N?', '','077001234568'),
('KH003', N'Lê Minh C??ng', '0123456791', N'?à N?ng', '1988-03-03', N'Nam', '','077001234569'),
('KH004', N'Ph?m Ng?c Di?u', '0123456792', N'H?i Phòng', '1991-04-04', N'N?', '','077001234570'),
('KH005', N'Ngô V?n ??t', '0123456793', N'Nha Trang', '1995-05-05', N'Nam', '','077001234571'),
('KH006', N'Bùi Th? Hu?', '0123456794', N'C?n Th?', '1993-06-06', N'N?', '','077001234572'),
('KH007', N'??ng V?n Kiên', '0123456795', N'H?i An', '1989-07-07', N'Nam', '','077001234573'),
('KH008', N'Lý Th? Mai', '0123456796', N'V?ng Tàu', '1996-08-08', N'N?', '','077001234574'),
('KH009', N'Nguy?n V?n Nam', '0123456797', N'Thành ph? Hu?', '1994-09-09', N'Nam', '','077001234575'),
('KH010', N'Tr?n Th? Oanh', '0123456798', N'B?c Ninh', '1990-10-10', N'N?', '','077001234576'),
('KH011', N'Lê V?n Phúc', '0123456799', N'Ninh Bình', '1987-11-11', 'Nam', '','077001234577'),
('KH012', N'Ph?m Th? Quyên', '0123456800', N'Quy Nh?n', '1985-12-12', N'N?', '','077001234578'),
('KH013', N'??ng V?n R?ng', '0123456801', N'V?nh Long', '1995-01-13', 'Nam', '','077001234579'),
('KH014', N'Nguy?n Th? S??ng', '0123456802', N'B?n Tre', '1992-02-14', N'N?', '','077001234580'),
('KH015', N'Lê V?n Tài', '0123456803', N'Long An', '1994-03-15', 'Nam', '','077001234581'),
('KH016', N'Tr?n Th? Uyên', '0123456804', N'Tây Ninh', '1991-04-16', N'N?', '','077001234582'),
('KH017', N'Ngô V?n Vinh', '0123456805', N'??ng Nai', '1989-05-17', 'Nam', '','077001234583'),
('KH018', N'Bùi Th? Xuân', '0123456806', N'Kiên Giang', '1993-06-18', N'N?', '','077001234584'),
('KH019', N'??ng V?n Y?n', '0123456807', N'Lâm ??ng', '1990-07-19', 'Nam', '','077001234585'),
('KH020', N'Lý Th? Zô', '0123456808', N'Thái Nguyên', '1988-08-20', N'N?', '','077001234586'),
('KH021', N'Nguy?n V?n Bình', '0123456809', N'Nam ??nh', '1996-09-21', N'Nam', '','077001234587'),
('KH022', N'Tr?n Th? ?an', '0123456810', N'Hà T?nh', '1995-10-22', N'N?', '','077001234588'),
('KH023', N'Lê V?n C??ng', '0123456811', N'Sóc Tr?ng', '1994-11-23', N'Nam', '','077001234589'),
('KH024', N'Ph?m Th? Huy?n', '0123456812', N'An Giang', '1993-12-24', N'N?', '','077001234590'),
('KH025', N'Ngô V?n Kh?i', '0123456813', N'?à L?t', '1992-01-25', N'Nam', '','077001234591'),
('KH026', N'Bùi Th? L?', '0123456814', N'B?c Giang', '1991-02-26', N'N?', '','077001234592'),
('KH027', N'??ng V?n Minh', '0123456815', N'Nam ??nh', '1993-03-27', N'Nam', '','077001234593'),
('KH028', N'Nguy?n Th? Hòa', '0123456816', N'Qu?ng Bình', '1990-04-28', N'N?', '','077001234594'),
('KH029', N'Lê V?n H?i', '0123456817', N'Hà Nam', '1992-05-29', N'Nam', '','077001234595'),
('KH030', N'Tr?n Th? Nhung', '0123456818', N'Phú Th?', '1991-06-30', N'N?', '','077001234596');
go
--- thêm d? li?u cho b?ng phòng
insert into Phong (MaPhong,SoPhong,KieuPhong,LoaiPhong,GiaMoiDem) values
('P0001','101',N'Gi??ng ??n',N'Tiêu chu?n',490000),
('P0002','102',N'Gi??ng ??n',N'Trung bình',650000),
('P0003','103',N'Gi??ng ??n',N'Th??ng gia',1000000),
('P0004','104',N'Gi??ng ?ôi',N'Tiêu chu?n',590000),
('P0005','105',N'Gi??ng ?ôi',N'Trung bình',800000),
('P0006','106',N'Gi??ng ?ôi',N'Th??ng gia',1500000),
('P0007','107',N'Gi??ng ??n',N'Trung bình',650000),
('P0008','108',N'Gi??ng ?ôi',N'Tiêu chu?n',590000),
('P0009','109',N'Gi??ng ??n',N'Th??ng gia',1000000),
('P0010','110',N'Gi??ng ??n',N'Tiêu chu?n',490000);
go
--- thêm du lieu cho bang dat phong
insert into DatPhong (MaDatPhong,MaKhachHang,MaPhong,NgayDatPhong,NgayNhanPhong,NgayTraPhong) values
('DP001','KH001','P0001','15/10/2024 1:00','17/10/2024 1:00','20/10/2024 1:00'),
('DP002','KH002','P0002','16/10/2024 1:00','19/10/2024 1:00','21/10/2024 1:00'),
('DP003','KH003','P0001','12/10/2024 1:00','12/10/2024 12:00','14/10/2024 12:00');
go
select * from DatPhong